//===============================================================================
//! @page Example1 Пример 1. Учимся строить простой граф.
//!
//! <b>На этом уроке вы научитесь:</b>
//! <ul> 
//! <li> <b>Рисовать узлы</b>
//! <li> <b>Рисовать связи (ссылки)</b>
//! </ul>
//! <br>
//! <b>Результат:</b> @image html Graph1.jpg<br>
//!
//! <b>Код:</b><br>
//! @include 1/1.cpp
//=============================================================================== 

//===============================================================================
//! @page Examples2 Пример 2. Учимся применять стили.
//!
//! <b>На этом уроке вы научитесь:</b>
//! <ul>
//! <li> <b>Изменять стили</b>
//! <li> <b>Применять стили</b>    
//! </ul>
//! <br>
//! <b>Результат:</b> @image html Graph2.jpg<br> 
//!
//! <b>Код:</b><br>
//! @include 2/2.cpp
//=============================================================================== 

//===============================================================================
//! @page Example3 Пример 3. Пример dump'а дерева.
//!
//! <b>На этом уроке вы научитесь:</b>
//! <ul>
//! <li> <b>Делать dump дерева.</b>
//! </ul>
//! <br>
//! <b>Результат:</b> @image html Graph3.jpg<br>
//!
//! <b>Код:</b><br>
//! @include 3/3.cpp
//===============================================================================

//===============================================================================
//! @page Example4 Пример 4. Самый сложный.
//!
//! <b>На этом уроке вы научитесь:</b>
//! <ul>
//! <li> <b>Делать dump дерева.</b>
//! <li> <b>Создавать кластеры.</b>
//! <li> <b>Строить дерево по выражению.</b>
//! <li> <b>Считать выражение, заданное деревом.</b>
//! <li> <b>Ассемблерировать строку.</b>
//! </ul>
//! <br>
//! <b>Результат:</b> @image html Graph4.jpg<br>
//!
//! <b>Код:</b><br>
//! Печать дерева
//! @include 4/TreePrinter.h
//! Сама программа
//! @include 4/4.cpp
//! Ну, и кому интересно:
//! Создание дерева
//! @include 4/CreateTree.h
//! Класс дерева
//! @include 4/Tree.h
//===============================================================================
