//! @mainpage
//! <b>Dotter</b><br> 
//! <b> $Copyright: (C) Danila Baygushev $ </b><br>
//! @warning <b>Для использования библиотеки требуется согласие автора.</b><br>
//!
//! <br>
//! <b>По вопросам и предложениям @StartCrossзахватить мир@EndCross просьба обращаться сюда: IDanila24@gmail.com.@StartCrossУ нас есть печеньки.@EndCross</b> 
//! <br>         
//! Библиотека для красивой визуализации деревьев и других графов на основе dot.
//! <br>
//! Dotter - библиотека для красивой визуализации деревьев и других графов на основе dot. Разработана с целью упростить дебаггинг деревьев и насладиться красотой. <br>
//!
//! @warning Работа библиотеки основывается на dot. Установка dot производится при установке Dotter. Для корректной работы Вашей программы, использующую Dotter, на другом компьютере требуется установка dot/Dotter. <br>
//!
//! Документация на русском языке.<br>
//! <br>
//!
//! <br>
//! Чтобы начать работу с библиотекой просто перейдите в раздел описания, и посмотрите примеры. <br>
